driver-tests/bpelse/assign/VariablePropertyTest/VariablePropertyJBI/test/StringConcatUsingPropertyVal/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prop="http://j2ee.netbeans.org/schema/propertiesSchema">
  <soapenv:Body>
    <prop:concatElem>
      <str1>This</str1>
      <str2> string</str2>
      <str3> is concated</str3>
      <concatedStr>null</concatedStr>
    </prop:concatElem>
  </soapenv:Body>
</soapenv:Envelope>