driver-tests/bpelse/assign/VariablePropertyTest/VariablePropertyJBI/test/select2ItemPredicateTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prop="http://j2ee.netbeans.org/schema/propertiesSchema">
  <soapenv:Body>
    <prop:itemElem>
      <item>shoe</item>
      <!--1 to 3 repetitions:-->
      <itemDetail>nike</itemDetail>
      <itemDetail>addidas</itemDetail>
      <itemDetail>puma</itemDetail>
      <price>50</price>
      <itemNum>1</itemNum>
    </prop:itemElem>
  </soapenv:Body>
</soapenv:Envelope>