driver-tests/bpelse/assign/VariablePropertyTest/VariablePropertyJBI/test/StringConcatUsingPropertyVal/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:concatElem xmlns:msgns="http://j2ee.netbeans.org/wsdl/properties" xmlns:ns1="http://j2ee.netbeans.org/schema/propertiesSchema">
      <str1 xmlns="">This</str1>
      <str2 xmlns=""> string</str2>
      <str3 xmlns=""> is concated</str3>
      <concatedStr xmlns="">This string is concated</concatedStr>
    </ns1:concatElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
