driver-tests/bpelse/assign/VariablePropertyTest/VariablePropertyJBI/test/select2ItemPredicateTest/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:itemElem xmlns:msgns="http://j2ee.netbeans.org/wsdl/properties" xmlns:ns1="http://j2ee.netbeans.org/schema/propertiesSchema">
      <item xmlns="">shoe</item>
      <itemDetail xmlns="">addidas</itemDetail>
      <price xmlns="">50</price>
      <itemNum xmlns="">1</itemNum>
    </ns1:itemElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
