driver-tests/bpelse/assign/VariablePropertyTest/VariablePropertyJBI/test/results/StringConcatUsingPropertyVal/Actual_20130222141657_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <concatElem xmlns="http://j2ee.netbeans.org/schema/propertiesSchema" xmlns:msgns="http://j2ee.netbeans.org/wsdl/properties">
      <str1 xmlns="">This</str1>
      <str2 xmlns=""> string</str2>
      <str3 xmlns=""> is concated</str3>
      <concatedStr xmlns="">This string is concated</concatedStr>
    </concatElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>